Autodesk.Revit.DB.Structure.RebarShapeParameters.GetAllRebarShapeParameters(Autodesk.Revit.DB.Document)
List all shape parameters used by all the existing RebarShapes in the specified document.
Remarks:
This method replaces RebarShape.GetAllRebarShapeParameters() from prior releases.
doc:
The document.
Returns:
ElementIds corresponding to the external parameters.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012